
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЭтотУзел Тогда 
		Элементы.ИспользоватьВОбмене.Видимость = Ложь;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.ИспользоватьВОбмене = Истина;
	КонецЕсли;	
	
КонецПроцедуры
	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ИспользоватьВОбмене Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МобОбмен.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.МобОбмен КАК МобОбмен
		|ГДЕ
		|	МобОбмен.ИспользоватьВОбмене
		|	И МобОбмен.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() <> 0 Тогда 
			Отказ = Истина;
			Сообщить("В обмене может учавствовать только один узел!");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
