
&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Объект.ДатаПодтвержедия = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Вспомогательный.ДобавитьПрочитанВРегистрОповещенийНаСервере(Объект.Ссылка);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Ответ = Вспомогательный.ПроверитьВыполнениеФЗ("Выгрузка");
	Если Ответ = Ложь Тогда 
		ФЗ = ФоновыеЗадания.Выполнить("МодульОбмена.ВыполнитьВыгрузкуДанных",,"Выгрузка"); 
	КонецЕсли;

КонецПроцедуры
