
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(НаборКонстант.WebСервис) Тогда 
		//НаборКонстант.WebСервис = "ExchangeConsultant";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(НаборКонстант.Порт) Тогда 
		НаборКонстант.Порт = 80;
	КонецЕсли;
	
	
	 
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Отказ Тогда 
		Если Не Вспомогательный.НастройкиОбменаЗаполнены() Тогда 
			
			Вспомогательный.ПроверитьИдентификаторНаСервере();
			
			IDКлиента = Константы.IDКлиента.Получить();

			
			ТекУзелСсылка = ПланыОбмена.МобОбмен.ЭтотУзел();
			ТекУзел = ТекУзелСсылка.ПолучитьОбъект();
			ТекУзел.Код = IDКлиента;
			ТекУзел.Наименование = Константы.Пользователь.Получить();
			ТекУзел.Записать();
			
			УзелЦБ = ПланыОбмена.МобОбмен.НайтиПоКоду("ЦБ");
			Если Не ЗначениеЗаполнено(УзелЦБ) Тогда 
				НовыйУзелОбмена = ПланыОбмена.МобОбмен.СоздатьУзел();
				НовыйУзелОбмена.Код = "ЦБ";
				НовыйУзелОбмена.Наименование = "База";
				НовыйУзелОбмена.ИспользоватьВОбмене = Истина;
				НовыйУзелОбмена.Записать();
			КонецЕсли;
			
			МодульОбмена.ВыполнитьПроверкуУзла();
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере(Отказ)
	ПроверитьЗаполнениеНастроек(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеНастроек(Отказ)
	Отказ = Ложь;
	СтрокаСообщения = "Заполните ";
	Если Не ЗначениеЗаполнено(НаборКонстант.Сервер) Тогда 
		Отказ = Истина;
		СтрокаСообщения = СтрокаСообщения + " IP адрес сервера";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(НаборКонстант.Пользователь) Тогда 
		Отказ = Истина;
		СтрокаСообщения = СтрокаСообщения + ?(СтрокаСообщения = "Заполните ",""," , ")+ "Пользователя";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(НаборКонстант.БазаДанных) Тогда 
		Отказ = Истина;
		СтрокаСообщения = СтрокаСообщения + ?(СтрокаСообщения = "Заполните ",""," , ")+ "Базу данных";
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(НаборКонстант.WebСервис) Тогда 
	//	Отказ = Истина;
	//	СтрокаСообщения = СтрокаСообщения + ?(СтрокаСообщения = "Заполните ",""," , ")+ "Web сервис";
	//КонецЕсли;
	
	
	Если Отказ Тогда 
		Сообщить(СтрокаСообщения);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере(Отказ);
КонецПроцедуры
