
Перем ЗначениеСтатуса;
Перем ЗначениеДатаПодтвержедия;
Перем ЗначениеКомментарий;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	ЗначениеСтатуса = Ссылка.Статус;
	ЗначениеДатаПодтвержедия = Ссылка.ДатаПодтвержедия;
	ЗначениеКомментарий = Ссылка.Комментарий;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъектИзменен = Ложь;
	Если ЗначениеСтатуса <> Статус Тогда 
		ОбъектИзменен = Истина;
	КонецЕсли;	
	
	Если ЗначениеДатаПодтвержедия <> ДатаПодтвержедия Тогда 
		ОбъектИзменен = Истина;
	КонецЕсли;	
	
	Если ЗначениеКомментарий <> Комментарий Тогда 
		ОбъектИзменен = Истина;
	КонецЕсли;	
	
	Если ОбъектИзменен Тогда 
		
		Выборка = ПланыОбмена.МобОбмен.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Ссылка = ПланыОбмена. МобОбмен.ЭтотУзел() Тогда
				Продолжить;
			КонецЕсли; 
			
			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, Ссылка);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
